"""
    Файл содержит глобальные определения для модуля hotels
"""

# Количество звёзд Отеля
NUM_STARS_LIST = [
    ('1178', 'Without stars'),
    ('1189', '1'),
    ('876',  '2'),
    ('812',  '3'),
    ('828',  '4'),
    ('884',  '5')
]

# Время заезда / выезда
TIME_LIST = [
    ('0', '00:00 - 01:00'),
    ('1', '01:00 - 02:00'),
    ('2', '02:00 - 03:00'),
    ('3', '03:00 - 04:00'),
    ('4', '04:00 - 05:00'),
    ('5', '05:00 - 06:00'),
    ('6', '06:00 - 07:00'),
    ('7', '07:00 - 08:00'),
    ('8', '08:00 - 09:00'),
    ('9', '09:00 - 10:00'),
    ('10', '10:00 - 11:00'),
    ('11', '11:00 - 12:00'),
    ('12', '12:00 - 13:00'),
    ('13', '13:00 - 14:00'),
    ('14', '14:00 - 15:00'),
    ('15', '15:00 - 16:00'),
    ('16', '16:00 - 17:00'),
    ('17', '17:00 - 18:00'),
    ('18', '18:00 - 19:00'),
    ('19', '19:00 - 20:00'),
    ('20', '20:00 - 21:00'),
    ('21', '21:00 - 22:00'),
    ('22', '22:00 - 23:00'),
    ('23', '23:00 - 00:00'),
]

# Период штрафных санкций
FINE_PERIOD_LIST = [
    ('14',  '14:00 on the day of arrival'),
    ('18',  '18:00 on the day of arrival'),
    ('24',  'Until 1 days before arrival'),
    ('48',  'Until 2 days before arrival'),
    ('72',  'Until 2 days before arrival'),
    ('120', 'Until 5 days before arrival'),
]

# Размер штрафа
FINE_SIZE_LIST = [
    ('1', 'The cost of the first night'),
    ('2',  '50% of the total price'),
    ('3', '100% of the total price'),
]
