# Время заезда
ARRIVAL_TIME_LIST = [
    ('0', '00:00 - 01:00'),
    ('1', '01:00 - 02:00'),
    ('2', '02:00 - 03:00'),
    ('3', '03:00 - 04:00'),
    ('4', '04:00 - 05:00'),
    ('5', '05:00 - 06:00'),
    ('6', '06:00 - 07:00'),
    ('7', '07:00 - 08:00'),
    ('8', '08:00 - 09:00'),
    ('9', '09:00 - 10:00'),
    ('10', '10:00 - 11:00'),
    ('11', '11:00 - 12:00'),
    ('12', '12:00 - 13:00'),
    ('13', '13:00 - 14:00'),
    ('14', '14:00 - 15:00'),
    ('15', '15:00 - 16:00'),
    ('16', '16:00 - 17:00'),
    ('17', '17:00 - 18:00'),
    ('18', '18:00 - 19:00'),
    ('19', '19:00 - 20:00'),
    ('20', '20:00 - 21:00'),
    ('21', '21:00 - 22:00'),
    ('22', '22:00 - 23:00'),
    ('23', '23:00 - 00:00'),
]

# Количество звёзд
NUM_STARS_LIST = [('a', 'None'), ('b', '1'), ('c', '2'), ('d', '3'), ('e', '4'), ('f', '5')]

# Период штрафных санкций
FINE_PERIOD_LIST = [
    ('hours_14', '14:00 on the day of arrival'),
    ('hours_18', '18:00 on the day of arrival'),
    ('days_2',   'Until 2 days before arrival'),
    ('days_3',   'Until 3 days before arrival'),
    ('days_5',   'Until 5 days before arrival'),
    ('days_7',   'Until 7 days before arrival'),
]

# Размер штрафа
FINE_SIZE_LIST = [
    ('first_night', 'The cost of the first night'),
    ('percent_50',  '50% of the total price'),
    ('percent_100', '100% of the total price'),
]

